cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'

# ===== Register repositories =====

tap 'clevercloud/tap'
tap 'hashicorp/tap'
tap 'mongodb/brew'
tap 'peripheryapp/periphery'
tap 'romkatv/powerlevel10k'

# ===== CLI tools / libraries =====

brew 'asciinema'
brew 'bloaty'
brew 'cairo'
brew 'capstone'
brew 'clevercloud/tap/clever-tools'
#brew 'cloudflared' # NOTE: Will enable once I start using it
brew 'cmake'
brew 'coreutils'
brew 'cryptography'
brew 'curl'
brew 'doctl'
brew 'exiftool'
brew 'fastlane'
brew 'fdupes'
brew 'ffmpeg'
brew 'gdk-pixbuf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gnupg'
brew 'gnutls'
brew 'gobject-introspection'
brew 'graphviz'
brew 'gts'
brew 'harfbuzz'
brew 'hashicorp/tap/nomad'
brew 'htop'
brew 'httpd'
brew 'hugo'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq'
brew 'ldns'
brew 'libass'
brew 'libavif'
brew 'libfido2'
brew 'libheif'
brew 'libpq'
brew 'librsvg'
brew 'libssh'
brew 'libssh2'
brew 'libwebsockets'
brew 'luarocks'
brew 'mercurial'
brew 'mysql-client'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openjdk@11'
brew 'openssh'
brew 'pango'
brew 'powerlevel10k'
brew 'rename'
brew 'ripgrep'
brew 's3cmd'
brew 'sccache'
brew 'stepci'
brew 'swagger-codegen'
brew 'swift-format'
brew 'swift-protobuf'
brew 'swiftformat'
brew 'swiftgen'
brew 'swiftlint'
brew 'go-task'
brew 'telnet'
brew 'tesseract'
brew 'testdisk'
brew 'tree'
brew 'unbound'
#brew 'upx' # NOTE: Deprecated
brew 'vapor'
brew 'volta'
brew 'watch'
brew 'wget'
brew 'winetricks'
brew 'wireguard-tools'
brew 'xclogparser'
brew 'ykman'
brew 'ykpers'
brew 'yt-dlp'

# ===== Softwares =====

cask 'periphery'
cask 'rar'
cask 'syntax-highlight'
cask 'wine-stable'
cask 'xcodes'
cask 'diffusionbee'
cask 'handbrake'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
cask 'fliqlo'

# ===== Visual Studio Code extensions =====

vscode '42crunch.vscode-openapi'
vscode 'abusaidm.html-snippets'
vscode 'ahebrank.yaml2json'
vscode 'alexkrechik.cucumberautocomplete'
vscode 'bierner.github-markdown-preview'
vscode 'bierner.markdown-checkbox'
vscode 'bierner.markdown-footnotes'
vscode 'bierner.markdown-mermaid'
vscode 'bierner.markdown-preview-github-styles'
vscode 'bierner.markdown-yaml-preamble'
vscode 'budparr.language-hugo-vscode'
vscode 'davidanson.vscode-markdownlint'
vscode 'dbaeumer.vscode-eslint'
vscode 'ecmel.vscode-html-css'
vscode 'eiminsasete.apacheconf-snippets'
vscode 'fcrespo82.markdown-table-formatter'
vscode 'gruntfuggly.todo-tree'
vscode 'jebbs.plantuml'
vscode 'jock.svg'
vscode 'kaellarkin.hugo-shortcode-syntax'
vscode 'mechatroner.rainbow-csv'
vscode 'mermade.openapi-lint'
vscode 'misogi.ruby-rubocop'
vscode 'mohsen1.prettify-json'
vscode 'mrmlnc.vscode-apache'
vscode 'mrmlnc.vscode-json5'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode.wordcount'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'platformio.platformio-ide'
vscode 'quicktype.quicktype'
vscode 'redhat.vscode-yaml'
vscode 'richie5um2.vscode-sort-json'
vscode 'rust-lang.rust-analyzer'
vscode 'shopify.ruby-lsp'
vscode 'sidthesloth.html5-boilerplate'
vscode 'sswg.swift-lang'
vscode 'svanimpe.stencil'
vscode 'tamasfe.even-better-toml'
vscode 'tomoyukim.vscode-mermaid-editor'
vscode 'tootone.org-mode'
vscode 'vadimcn.vscode-lldb'
vscode 'vue.volar'
vscode 'waderyan.gitblame'
vscode 'yzane.markdown-pdf'
vscode 'yzhang.markdown-all-in-one'
